MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAMR30E18A/mcu.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;
  /* CORTEX-M0PLUS handlers */
  void* pfnReset_Handler;                        /* -15 Reset Vector, invoked on Power up and warm reset */
  void* pfnNonMaskableInt_Handler;               /* -14 Non maskable Interrupt, cannot be stopped or preempted */
  void* pfnHardFault_Handler;                    /* -13 Hard Fault, all classes of Fault */
  void* pvReservedC12;
  void* pvReservedC11;
  void* pvReservedC10;
  void* pvReservedC9;
  void* pvReservedC8;
  void* pvReservedC7;
  void* pvReservedC6;
  void* pfnSVCall_Handler;                       /*  -5 System Service Call via SVC instruction */
  void* pvReservedC4;
  void* pvReservedC3;
  void* pfnPendSV_Handler;                       /*  -2 Pendable request for system service */
  void* pfnSysTick_Handler;                      /*  -1 System Tick Timer */

  /* Peripheral handlers */
  void* pfnSYSTEM_Handler;                       /*   0 System peripherals shared interrupt (MCLK OSCCTRL OSC32KCTRL PAC PM SUPC) */
  void* pfnWDT_Handler;                          /*   1 Watchdog Timer (WDT) */
  void* pfnRTC_Handler;                          /*   2 Real-Time Counter (RTC) */
  void* pfnEIC_Handler;                          /*   3 External Interrupt Controller (EIC) */
  void* pfnNVMCTRL_Handler;                      /*   4 Non-Volatile Memory Controller (NVMCTRL) */
  void* pfnDMAC_Handler;                         /*   5 Direct Memory Access Controller (DMAC) */
  void* pfnUSB_Handler;                          /*   6 Universal Serial Bus (USB) */
  void* pfnEVSYS_Handler;                        /*   7 Event System Interface (EVSYS) */
  void* pfnSERCOM0_Handler;                      /*   8 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM1_Handler;                      /*   9 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM2_Handler;                      /*  10 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM3_Handler;                      /*  11 Serial Communication Interface (SERCOM3) */
  void* pfnSERCOM4_Handler;                      /*  12 Serial Communication Interface (SERCOM4) */
  void* pfnSERCOM5_Handler;                      /*  13 Serial Communication Interface (SERCOM5) */
  void* pfnTCC0_Handler;                         /*  14 Timer Counter Control (TCC0) */
  void* pfnTCC1_Handler;                         /*  15 Timer Counter Control (TCC1) */
  void* pfnTCC2_Handler;                         /*  16 Timer Counter Control (TCC2) */
  void* pfnTC0_Handler;                          /*  17 Basic Timer Counter (TC0) */
  void* pfnTC1_Handler;                          /*  18 Basic Timer Counter (TC1) */
  void* pvReserved19;
  void* pvReserved20;
  void* pfnTC4_Handler;                          /*  21 Basic Timer Counter (TC4) */
  void* pfnADC_Handler;                          /*  22 Analog Digital Converter (ADC) */
  void* pfnAC_Handler;                           /*  23 Analog Comparators (AC) */
  void* pvReserved24;
  void* pfnPTC_Handler;                          /*  25 Peripheral Touch Controller (PTC) */
} DeviceVectors;

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if !defined DONT_USE_PREDEFINED_CORE_HANDLERS
/* CORTEX-M0PLUS exception handlers */
void Reset_Handler                 ( void );
void NonMaskableInt_Handler        ( void );
void HardFault_Handler             ( void );
void SVCall_Handler                ( void );
void PendSV_Handler                ( void );
void SysTick_Handler               ( void );
#endif /* DONT_USE_PREDEFINED_CORE_HANDLERS */

#if !defined DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS
/* Peripherals interrupt handlers */
void SYSTEM_Handler                ( void );
void WDT_Handler                   ( void );
void RTC_Handler                   ( void );
void EIC_Handler                   ( void );
void NVMCTRL_Handler               ( void );
void DMAC_Handler                  ( void );
void USB_Handler                   ( void );
void EVSYS_Handler                 ( void );
void SERCOM0_Handler               ( void );
void SERCOM1_Handler               ( void );
void SERCOM2_Handler               ( void );
void SERCOM3_Handler               ( void );
void SERCOM4_Handler               ( void );
void SERCOM5_Handler               ( void );
void TCC0_Handler                  ( void );
void TCC1_Handler                  ( void );
void TCC2_Handler                  ( void );
void TC0_Handler                   ( void );
void TC1_Handler                   ( void );
void TC4_Handler                   ( void );
void ADC_Handler                   ( void );
void AC_Handler                    ( void );
void PTC_Handler                   ( void );
#endif /* DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* Configuration of the CORTEX-M0PLUS Processor and Core Peripherals */
#define __CM0PLUS_REV                 0x0001 /* Cortex-M0+ Core Revision                                                  */
#define __MPU_PRESENT                      0 /* MPU present or not                                                        */
#define __NVIC_PRIO_BITS                   2 /* Number of Bits used for Priority Levels                                   */
#define __VTOR_PRESENT                     1 /* Vector Table Offset Register present or not                               */
#define __Vendor_SysTickConfig             0 /* Set to 1 if different SysTick Config is used                              */
#define __ARCH_ARM                         1
#define __ARCH_ARM_CORTEX_M                1

/* CMSIS includes */
// Note: Changed for MikroE implementation.
// #include "core_cm0plus.h"
#if defined USE_CMSIS_INIT
// Note: Changed for MikroE implementation.
// #include "system_samr30.h"
#endif /* USE_CMSIS_INIT */

/* ************************************************************************** */
/*   SOFTWARE PERIPHERAL API DEFINITION FOR SAMR30E18A                        */
/* ************************************************************************** */
#include "component/ac.h"
#include "component/adc.h"
#include "component/ccl.h"
#include "component/dmac.h"
#include "component/dsu.h"
#include "component/eic.h"
#include "component/evsys.h"
#include "component/fuses.h"
#include "component/gclk.h"
#include "component/mclk.h"
#include "component/mtb.h"
#include "component/nvmctrl.h"
#include "component/osc32kctrl.h"
#include "component/oscctrl.h"
#include "component/pac.h"
#include "component/pm.h"
#include "component/port.h"
#include "component/ptc.h"
#include "component/rfctrl.h"
#include "component/rstc.h"
#include "component/rtc.h"
#include "component/sercom.h"
#include "component/supc.h"
#include "component/tc.h"
#include "component/tcc.h"
#include "component/usb.h"
#include "component/wdt.h"

/* ************************************************************************** */
/*   INSTANCE DEFINITIONS FOR SAMR30E18A */
/* ************************************************************************** */
#include "instance/ac.h"
#include "instance/adc.h"
#include "instance/ccl.h"
#include "instance/dmac.h"
#include "instance/dsu.h"
#include "instance/eic.h"
#include "instance/evsys.h"
#include "instance/fuses.h"
#include "instance/gclk.h"
#include "instance/mclk.h"
#include "instance/mtb.h"
#include "instance/nvmctrl.h"
#include "instance/osc32kctrl.h"
#include "instance/oscctrl.h"
#include "instance/pac.h"
#include "instance/pm.h"
#include "instance/port.h"
#include "instance/ptc.h"
#include "instance/rfctrl.h"
#include "instance/rstc.h"
#include "instance/rtc.h"
#include "instance/sercom0.h"
#include "instance/sercom1.h"
#include "instance/sercom2.h"
#include "instance/sercom3.h"
#include "instance/sercom4.h"
#include "instance/sercom5.h"
#include "instance/supc.h"
#include "instance/tc0.h"
#include "instance/tc1.h"
#include "instance/tc4.h"
#include "instance/tcc0.h"
#include "instance/tcc1.h"
#include "instance/tcc2.h"
#include "instance/usb.h"
#include "instance/wdt.h"

/* ************************************************************************** */
/*  PERIPHERAL ID DEFINITIONS FOR SAMR30E18A                                  */
/* ************************************************************************** */
#define ID_PM            (  0) /* Power Manager (PM) */
#define ID_MCLK          (  1) /* Main Clock (MCLK) */
#define ID_RSTC          (  2) /* Reset Controller (RSTC) */
#define ID_OSCCTRL       (  3) /* Oscillators Control (OSCCTRL) */
#define ID_OSC32KCTRL    (  4) /* 32k Oscillators Control (OSC32KCTRL) */
#define ID_SUPC          (  5) /* Supply Controller (SUPC) */
#define ID_GCLK          (  6) /* Generic Clock Generator (GCLK) */
#define ID_WDT           (  7) /* Watchdog Timer (WDT) */
#define ID_RTC           (  8) /* Real-Time Counter (RTC) */
#define ID_EIC           (  9) /* External Interrupt Controller (EIC) */
#define ID_PORT          ( 10) /* Port Module (PORT) */
#define ID_USB           ( 32) /* Universal Serial Bus (USB) */
#define ID_DSU           ( 33) /* Device Service Unit (DSU) */
#define ID_NVMCTRL       ( 34) /* Non-Volatile Memory Controller (NVMCTRL) */
#define ID_MTB           ( 35) /* Cortex-M0+ Micro-Trace Buffer (MTB) */
#define ID_SERCOM0       ( 64) /* Serial Communication Interface (SERCOM0) */
#define ID_SERCOM1       ( 65) /* Serial Communication Interface (SERCOM1) */
#define ID_SERCOM2       ( 66) /* Serial Communication Interface (SERCOM2) */
#define ID_SERCOM3       ( 67) /* Serial Communication Interface (SERCOM3) */
#define ID_SERCOM4       ( 68) /* Serial Communication Interface (SERCOM4) */
#define ID_TCC0          ( 69) /* Timer Counter Control (TCC0) */
#define ID_TCC1          ( 70) /* Timer Counter Control (TCC1) */
#define ID_TCC2          ( 71) /* Timer Counter Control (TCC2) */
#define ID_TC0           ( 72) /* Basic Timer Counter (TC0) */
#define ID_TC1           ( 73) /* Basic Timer Counter (TC1) */
#define ID_RFCTRL        ( 85) /* RF212B control module (RFCTRL) */
#define ID_EVSYS         ( 96) /* Event System Interface (EVSYS) */
#define ID_SERCOM5       ( 97) /* Serial Communication Interface (SERCOM5) */
#define ID_TC4           ( 98) /* Basic Timer Counter (TC4) */
#define ID_ADC           ( 99) /* Analog Digital Converter (ADC) */
#define ID_AC            (100) /* Analog Comparators (AC) */
#define ID_PTC           (101) /* Peripheral Touch Controller (PTC) */
#define ID_CCL           (103) /* Configurable Custom Logic (CCL) */
#define ID_PAC           (128) /* Peripheral Access Controller (PAC) */
#define ID_DMAC          (129) /* Direct Memory Access Controller (DMAC) */

#define ID_PERIPH_MAX    (129) /* Number of peripheral IDs */

/* ************************************************************************** */
/*   REGISTER STRUCTURE ADDRESS DEFINITIONS FOR SAMR30E18A                    */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define AC_REGS                          ((ac_registers_t*)0x43001000)                 /* AC Registers Address         */
#define ADC_REGS                         ((adc_registers_t*)0x43000c00)                /* ADC Registers Address        */
#define CCL_REGS                         ((ccl_registers_t*)0x43001c00)                /* CCL Registers Address        */
#define DMAC_REGS                        ((dmac_registers_t*)0x44000400)               /* DMAC Registers Address       */
#define DSU_REGS                         ((dsu_registers_t*)0x41002000)                /* DSU Registers Address        */
#define EIC_REGS                         ((eic_registers_t*)0x40002400)                /* EIC Registers Address        */
#define EVSYS_REGS                       ((evsys_registers_t*)0x43000000)              /* EVSYS Registers Address      */
#define GCLK_REGS                        ((gclk_registers_t*)0x40001800)               /* GCLK Registers Address       */
#define MCLK_REGS                        ((mclk_registers_t*)0x40000400)               /* MCLK Registers Address       */
#define MTB_REGS                         ((mtb_registers_t*)0x41006000)                /* MTB Registers Address        */
#define NVMCTRL_REGS                     ((nvmctrl_registers_t*)0x41004000)            /* NVMCTRL Registers Address    */
#define OTP5_FUSES_REGS                  ((fuses_otp5_fuses_registers_t*)0x00806020)   /* FUSES Registers Address      */
#define TEMP_LOG_FUSES_REGS              ((fuses_temp_log_fuses_registers_t*)0x00806030) /* FUSES Registers Address      */
#define USER_FUSES_REGS                  ((fuses_user_fuses_registers_t*)0x00804000)   /* FUSES Registers Address      */
#define OSCCTRL_REGS                     ((oscctrl_registers_t*)0x40000c00)            /* OSCCTRL Registers Address    */
#define OSC32KCTRL_REGS                  ((osc32kctrl_registers_t*)0x40001000)         /* OSC32KCTRL Registers Address */
#define PAC_REGS                         ((pac_registers_t*)0x44000000)                /* PAC Registers Address        */
#define PM_REGS                          ((pm_registers_t*)0x40000000)                 /* PM Registers Address         */
#define PORT_REGS                        ((port_registers_t*)0x40002800)               /* PORT Registers Address       */
#define PORT_IOBUS_REGS                  ((port_registers_t*)0x60000000)               /* PORT Registers Address       */
#define PTC_REGS                         ((ptc_registers_t*)0x43001400)                /* PTC Registers Address        */
#define RFCTRL_REGS                      ((rfctrl_registers_t*)0x42003c00)             /* RFCTRL Registers Address     */
#define RSTC_REGS                        ((rstc_registers_t*)0x40000800)               /* RSTC Registers Address       */
#define RTC_REGS                         ((rtc_registers_t*)0x40002000)                /* RTC Registers Address        */
#define SERCOM0_REGS                     ((sercom_registers_t*)0x42000000)             /* SERCOM0 Registers Address    */
#define SERCOM1_REGS                     ((sercom_registers_t*)0x42000400)             /* SERCOM1 Registers Address    */
#define SERCOM2_REGS                     ((sercom_registers_t*)0x42000800)             /* SERCOM2 Registers Address    */
#define SERCOM3_REGS                     ((sercom_registers_t*)0x42000c00)             /* SERCOM3 Registers Address    */
#define SERCOM4_REGS                     ((sercom_registers_t*)0x42001000)             /* SERCOM4 Registers Address    */
#define SERCOM5_REGS                     ((sercom_registers_t*)0x43000400)             /* SERCOM5 Registers Address    */
#define SUPC_REGS                        ((supc_registers_t*)0x40001400)               /* SUPC Registers Address       */
#define TC0_REGS                         ((tc_registers_t*)0x42002000)                 /* TC0 Registers Address        */
#define TC1_REGS                         ((tc_registers_t*)0x42002400)                 /* TC1 Registers Address        */
#define TC4_REGS                         ((tc_registers_t*)0x43000800)                 /* TC4 Registers Address        */
#define TCC0_REGS                        ((tcc_registers_t*)0x42001400)                /* TCC0 Registers Address       */
#define TCC1_REGS                        ((tcc_registers_t*)0x42001800)                /* TCC1 Registers Address       */
#define TCC2_REGS                        ((tcc_registers_t*)0x42001c00)                /* TCC2 Registers Address       */
#define USB_REGS                         ((usb_registers_t*)0x41000000)                /* USB Registers Address        */
#define WDT_REGS                         ((wdt_registers_t*)0x40001c00)                /* WDT Registers Address        */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR SAMR30E18A                                  */
/* ************************************************************************** */
#define AC_BASE_ADDRESS                  _UL_(0x43001000)                              /* AC Base Address */
#define ADC_BASE_ADDRESS                 _UL_(0x43000c00)                              /* ADC Base Address */
#define CCL_BASE_ADDRESS                 _UL_(0x43001c00)                              /* CCL Base Address */
#define DMAC_BASE_ADDRESS                _UL_(0x44000400)                              /* DMAC Base Address */
#define DSU_BASE_ADDRESS                 _UL_(0x41002000)                              /* DSU Base Address */
#define EIC_BASE_ADDRESS                 _UL_(0x40002400)                              /* EIC Base Address */
#define EVSYS_BASE_ADDRESS               _UL_(0x43000000)                              /* EVSYS Base Address */
#define GCLK_BASE_ADDRESS                _UL_(0x40001800)                              /* GCLK Base Address */
#define MCLK_BASE_ADDRESS                _UL_(0x40000400)                              /* MCLK Base Address */
#define MTB_BASE_ADDRESS                 _UL_(0x41006000)                              /* MTB Base Address */
#define NVMCTRL_BASE_ADDRESS             _UL_(0x41004000)                              /* NVMCTRL Base Address */
#define OTP5_FUSES_BASE_ADDRESS          _UL_(0x00806020)                              /* FUSES Base Address */
#define TEMP_LOG_FUSES_BASE_ADDRESS      _UL_(0x00806030)                              /* FUSES Base Address */
#define USER_FUSES_BASE_ADDRESS          _UL_(0x00804000)                              /* FUSES Base Address */
#define OSCCTRL_BASE_ADDRESS             _UL_(0x40000c00)                              /* OSCCTRL Base Address */
#define OSC32KCTRL_BASE_ADDRESS          _UL_(0x40001000)                              /* OSC32KCTRL Base Address */
#define PAC_BASE_ADDRESS                 _UL_(0x44000000)                              /* PAC Base Address */
#define PM_BASE_ADDRESS                  _UL_(0x40000000)                              /* PM Base Address */
#define PORT_BASE_ADDRESS                _UL_(0x40002800)                              /* PORT Base Address */
#define PORT_IOBUS_BASE_ADDRESS          _UL_(0x60000000)                              /* PORT Base Address */
#define PTC_BASE_ADDRESS                 _UL_(0x43001400)                              /* PTC Base Address */
#define RFCTRL_BASE_ADDRESS              _UL_(0x42003c00)                              /* RFCTRL Base Address */
#define RSTC_BASE_ADDRESS                _UL_(0x40000800)                              /* RSTC Base Address */
#define RTC_BASE_ADDRESS                 _UL_(0x40002000)                              /* RTC Base Address */
#define SERCOM0_BASE_ADDRESS             _UL_(0x42000000)                              /* SERCOM0 Base Address */
#define SERCOM1_BASE_ADDRESS             _UL_(0x42000400)                              /* SERCOM1 Base Address */
#define SERCOM2_BASE_ADDRESS             _UL_(0x42000800)                              /* SERCOM2 Base Address */
#define SERCOM3_BASE_ADDRESS             _UL_(0x42000c00)                              /* SERCOM3 Base Address */
#define SERCOM4_BASE_ADDRESS             _UL_(0x42001000)                              /* SERCOM4 Base Address */
#define SERCOM5_BASE_ADDRESS             _UL_(0x43000400)                              /* SERCOM5 Base Address */
#define SUPC_BASE_ADDRESS                _UL_(0x40001400)                              /* SUPC Base Address */
#define TC0_BASE_ADDRESS                 _UL_(0x42002000)                              /* TC0 Base Address */
#define TC1_BASE_ADDRESS                 _UL_(0x42002400)                              /* TC1 Base Address */
#define TC4_BASE_ADDRESS                 _UL_(0x43000800)                              /* TC4 Base Address */
#define TCC0_BASE_ADDRESS                _UL_(0x42001400)                              /* TCC0 Base Address */
#define TCC1_BASE_ADDRESS                _UL_(0x42001800)                              /* TCC1 Base Address */
#define TCC2_BASE_ADDRESS                _UL_(0x42001c00)                              /* TCC2 Base Address */
#define USB_BASE_ADDRESS                 _UL_(0x41000000)                              /* USB Base Address */
#define WDT_BASE_ADDRESS                 _UL_(0x40001c00)                              /* WDT Base Address */

/* ************************************************************************** */
/*   PIO DEFINITIONS FOR SAMR30E18A                                           */
/* ************************************************************************** */
// Note: Changed for MikroE implementation.
// #include "pio/samr30e18a.h"

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR SAMR30E18A                                */
/* ************************************************************************** */

#define FLASH_SIZE                     _UL_(0x00040000)    /*  256kB Memory segment type: flash */
#define FLASH_PAGE_SIZE                _UL_(        64)
#define FLASH_NB_OF_PAGES              _UL_(      4096)

#define CAL_SIZE                       _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define LOCKBIT_SIZE                   _UL_(0x00000004)    /*    0kB Memory segment type: fuses */
#define OTP1_SIZE                      _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP2_SIZE                      _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP3_SIZE                      _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP4_SIZE                      _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP5_SIZE                      _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define TEMP_LOG_SIZE                  _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define USER_PAGE_SIZE                 _UL_(0x00000100)    /*    0kB Memory segment type: user_page */
#define USER_PAGE_PAGE_SIZE            _UL_(        64)
#define USER_PAGE_NB_OF_PAGES          _UL_(         4)

#define RWW_SIZE                       _UL_(0x00002000)    /*    8kB Memory segment type: flash */
#define RWW_PAGE_SIZE                  _UL_(        64)
#define RWW_NB_OF_PAGES                _UL_(       128)

#define HSRAM_SIZE                     _UL_(0x00008000)    /*   32kB Memory segment type: ram */
#define LPRAM_SIZE                     _UL_(0x00002000)    /*    8kB Memory segment type: ram */
#define HPB0_SIZE                      _UL_(0x00004000)    /*   16kB Memory segment type: io */
#define HPB1_SIZE                      _UL_(0x00010000)    /*   64kB Memory segment type: io */
#define HPB2_SIZE                      _UL_(0x00008000)    /*   32kB Memory segment type: io */
#define HPB3_SIZE                      _UL_(0x00002000)    /*    8kB Memory segment type: io */
#define HPB4_SIZE                      _UL_(0x00001000)    /*    4kB Memory segment type: io */
#define PPB_SIZE                       _UL_(0x00100000)    /* 1024kB Memory segment type: io */
#define SCS_SIZE                       _UL_(0x00001000)    /*    4kB Memory segment type: io */
#define PERIPHERALS_SIZE               _UL_(0x20000000)    /* 524288kB Memory segment type: io */

